# include <iostream>
# include <cmath>
using namespace std;
int main(){
    setlocale(LC_ALL, "rus");
    float a, b, c, S, r, R, h, m;
    cout << "Введите длины сторон треугольника: ";
    cin >> a;
    cin >> b;
    cin >> c;
    if ((a + b > c) and (b + c > a) and (a + c > b)){
        if (a == b and b == c and a == c){
            h = sqrt(a * a - (a/2)*(a/2));
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равносторонний, высота, медиана и биссектриса = " << h << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if ((a * a + b * b == c * c) and (a == b)){
            h = (a * b) / c;
            m = (c / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный и прямоугольный, " << a << " и " << b << " - катеты, " << c << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if ((c * c + b * b == a * a) and (b == c)){
            h = (c * b) / a;
            m = (a / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный и прямоугольный, " << c << " и " << b << " - катеты, " << a << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if ((a * a + c * c == b * b) and (a == c)){
            h = (a * c) / b;
            m = (b / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный и прямоугольный, " << a << " и " << c << " - катеты, " << b << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (a == b){
            h = sqrt((a * a) - (c / 2) * (c / 2));
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный, " << a << " и " << b << " - боковые стороны, " << c << " - основание; высота, медиана и гипотенуза = " << h << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (c == b){
            h = sqrt((c * c) - (a / 2) * (a / 2));
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный, " << c << " и " << b << " - боковые стороны, " << a << " - основание; высота, медиана и гипотенуза = " << h << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (a == c){
            h = sqrt((a * a) - (b / 2) * (b / 2));
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник равнобедренный, " << a << " и " << c << " - боковые стороны, " << b << " - основание; высота, медиана и гипотенуза = " << h << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (a * a + b * b == c * c){
            h = (a * b) / c;
            m = (c / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник прямоугольный, " << a << " и " << b << " - катеты, " << c << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (c * c + b * b == a * a){
            h = (c * b) / a;
            m = (a / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник прямоугольный, " << c << " и " << b << " - катеты, " << a << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else if (a * a + c * c == b * b){
            h = (a * c) / b;
            m = (b / 2);
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник прямоугольный, " << a << " и " << c << " - катеты, " << b << " - Гипотенуза; высота = " << h << ", медиана = " << m << ", площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
        else {
            float p = (a + b + c) / 2;
            S = sqrt(p * (p - a) * (p - b) * (p - c));
            r = S / p;
            R = (a * b * c) / (4 * S);
            cout << "Треугольник разносторонний, " << a << ", " << b << " и " << c << " - стороны; площадь = " << S << ", радиус вписанной окружности = " << r << ", радиус описанной окружности = " << R;
        }
    }
    else{
        cout << "Треугольник не существует (Вырожденный)";
    }
    system("pause");
    return 0;
}